app/controllers/kihus_controller.rb

SELECT "kihus".* FROM "kihus"
---
  def index
    @kihus = Kihu.all

INSERT INTO "kihus" ("teban", "won", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["teban", "sente"], ["won", false], ["created_at", 2016-08-11 11:33:45 UTC], ["updated_at", 2016-08-11 11:33:45 UTC]]
---
  def create

    @kihu = Kihu.build_with_params kihu_params

    respond_to do |format|
      if @kihu.save

DELETE FROM "kihus" WHERE "kihus"."id" = ?  [["id", 4]]
---
  def destroy
    @kihu.destroy

SELECT  "kihus".* FROM "kihus" WHERE "kihus"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
    def set_kihu
      @kihu = Kihu.find(params[:id])